{"config": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "dilation_rate": [1, 1], "dtype": "float32", "batch_input_shape": [null, 3, 48, 48], "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "bias_regularizer": null, "filters": 32, "activation": "relu", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "bias_regularizer": null, "filters": 32, "activation": "relu", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "bias_regularizer": null, "filters": 64, "activation": "relu", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "bias_regularizer": null, "filters": 64, "activation": "relu", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "noise_shape": null, "name": "dropout_2", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "bias_regularizer": null, "filters": 128, "activation": "relu", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "conv2d_6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "strides": [1, 1], "data_format": "channels_first", "bias_regularizer": null, "filters": 128, "activation": "relu", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "noise_shape": null, "name": "dropout_3", "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"units": 512, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_4", "seed": null}, "class_name": "Dropout"}, {"config": {"units": 3, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.4"}